[{
    "Book_Name": "Twilight",
    "Author": "Stephenie Meyer",
    "Year": 2005,
    "Quantity": 15,
    "Category": "romance",
    "Description": "When Isabella Swan moves to the gloomy town of Forks and meets the mysterious, alluring Edward Cullen, her life takes a thrilling and terrifying turn. With his porcelain skin, golden eyes, mesmerizing voice, and supernatural gifts, Edward is both irresistible and impenetrable. Up until now, he has managed to keep his true identity hidden, but Bella is determined to uncover his dark secret.",
    "Image": "https://covers.openlibrary.org/b/id/12641977-L.jpg"
  },
  {
    "Book_Name": "Fifty Shades of Grey",
    "Author": "E. L. James",
    "Year": 2011,
    "Quantity": 22,
    "Category": "romance",
    "Description": "When literature student Anastasia Steele goes to interview young entrepreneur Christian Grey, she encounters a man who is beautiful, brilliant, and intimidating. The unworldly, innocent Ana is startled to realize she wants this man and, despite his enigmatic reserve, finds she is desperate to get close to him.",
    "Image": "https://covers.openlibrary.org/b/id/12648183-L.jpg"
  },
  {
    "Book_Name": "New Moon",
    "Author": "Stephenie Meyer",
    "Year": 2006,
    "Quantity": 17,
    "Category": "romance",
    "Description": "After Bella Swan recovers from the vampire attack that almost claimed her life, she looks to celebrate her birthday with Edward and his family. However, a minor accident during the festivities results in Bella's blood being shed, a sight that proves too intense for the Cullens, who decide to leave the town of Forks, Washington for Bella and Edward's sake. Initially heartbroken, Bella finds a form of comfort in reckless living, as well as an even-closer friendship with Jacob Black. Danger in different forms awaits.",
    "Image": "https://covers.openlibrary.org/b/id/12643406-L.jpg"
  },
  {
    "Book_Name": "Fifty Shades Darker",
    "Author": "E. L. James",
    "Year": 2011,
    "Quantity": 40,
    "Category": "romance",
    "Description": "Daunted by the singular tastes and dark secrets of the beautiful, tormented young entrepreneur Christian Grey, Anastasia Steele has broken off their relationship to start a new career with a Seattle publishing house.",
    "Image": "https://covers.openlibrary.org/b/id/14566702-L.jpg"
  },
  {
    "Book_Name": "Fifty Shades Freed",
    "Author": "E. L. James",
    "Year": 2011,
    "Quantity": 12,
    "Category": "romance",
    "Description": "When unworldly student Anastasia Steele first encountered the driven and dazzling young entrepreneur Christian Grey, it sparked a sensual affair that changed both of their lives irrevocably. Shocked, intrigued, and, ultimately, repelled by Christian’s singular erotic tastes, Ana demands a deeper commitment. Determined to keep her, Christian agrees.",
    "Image": "https://covers.openlibrary.org/b/id/14566669-L.jpg"
  },
  {
    "Book_Name": "The Fault in Our Stars",
    "Author": "John Green",
    "Year": 2010,
    "Quantity": 37,
    "Category": "romance",
    "Description": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel’s story is about to be completely rewritten.",
    "Image": "https://covers.openlibrary.org/b/id/7418786-L.jpg"
  },
  {
    "Book_Name": "Eclipse",
    "Author": "Stephenie Meyer",
    "Year": 2006,
    "Quantity": 23,
    "Category": "romance",
    "Description": "As Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge, Bella once again finds herself surrounded by danger. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob—knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella has one more decision to make: life or death.",
    "Image": "https://covers.openlibrary.org/b/id/12643410-L.jpg"
  },
  {
    "Book_Name": "Romancing Mister Bridgerton",
    "Author": "Julia Quinn",
    "Year": 2002,
    "Quantity": 22,
    "Category": "romance",
    "Description": "Everyone knows that Colin Bridgerton is the most charming man in London. Penelope Featherington has secretly adored her best friend's brother for... well, it feels like forever. After half a lifetime of watching Colin Bridgerton from afar, she thinks she knows everything about him, until she stumbles across his deepest secret... and fears she doesn't know him at all.",
    "Image": "https://covers.openlibrary.org/b/id/237493-L.jpg"
  },
  {
    "Book_Name": "Americanah",
    "Author": "Chimamanda Ngozi Adichie",
    "Year": 2013,
    "Quantity": 17,
    "Category": "romance",
    "Description": "Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a dangerous, undocumented life in London.",
    "Image": "https://covers.openlibrary.org/b/id/8474037-L.jpg"
  },
  {
    "Book_Name": "Oryx and Crake",
    "Author": "Margaret Atwood",
    "Year": 2002,
    "Quantity": 20,
    "Category": "romance",
    "Description": "Oryx and Crake is at once an unforgettable love story and a compelling vision of the future. Snowman, known as Jimmy before mankind was overwhelmed by a plague, is struggling to survive in a world where he may be the last human, and mourning the loss of his best friend, Crake, and the beautiful and elusive Oryx whom they both loved.",
    "Image": "https://covers.openlibrary.org/b/id/12507658-L.jpg"
  },
  {
    "Book_Name": "Atonement",
    "Author": "Ian McEwan",
    "Year": 2001,
    "Quantity": 27,
    "Category": "romance",
    "Description": "On a hot summer day in 1935, thirteen-year-old Briony Tallis witnesses a moment’s flirtation between her older sister, Cecilia, and Robbie Turner, the son of a servant and Cecilia’s childhood friend. But Briony’s incomplete grasp of adult motives—together with her precocious literary gifts—brings about a crime that will change all their lives.",
    "Image": "https://covers.openlibrary.org/b/id/8381043-L.jpg"
  },
  {
    "Book_Name": "Divergent",
    "Author": "Veronica Roth",
    "Year": 2010,
    "Quantity": 26,
    "Category": "romance",
    "Description": "In a future Chicago, 16-year-old Beatrice Prior must choose among five predetermined factions to define her identity for the rest of her life, a decision made more difficult when she discovers that she is an anomaly who does not fit into any one group, and that the society she lives in is not perfect after all.",
    "Image": "https://covers.openlibrary.org/b/id/13274634-L.jpg"
  },
  {
    "Book_Name": "Purple Hibiscus",
    "Author": "Chimamanda Ngozi Adichie",
    "Year": 2003,
    "Quantity": 27,
    "Category": "romance",
    "Description": "Fifteen-year-old Kambili and her older brother Jaja lead a privileged life in Enugu, Nigeria. They live in a beautiful house, with a caring family, and attend an exclusive missionary school. They're completely shielded from the troubles of the world. Yet, as Kambili reveals in her tender-voiced account, things are less perfect than they appear.",
    "Image": "https://covers.openlibrary.org/b/id/12063933-L.jpg"
  },
  {
    "Book_Name": "Paper towns",
    "Author": "John Green",
    "Year": 2008,
    "Quantity": 40,
    "Category": "romance",
    "Description": "Quentin Jacobsen has spent a lifetime loving the magnificently adventurous Margo Roth Spiegelman from afar. So when she cracks open a window and climbs back into his life—dressed like a ninja and summoning him for an ingenious campaign of revenge—he follows.",
    "Image": "https://covers.openlibrary.org/b/id/5731773-L.jpg"
  },
  {
    "Book_Name": "The Nightingale",
    "Author": "Kristin Hannah",
    "Year": 2000,
    "Quantity": 26,
    "Category": "romance",
    "Description": "With courage, grace, and powerful insight, bestselling author Kristin Hannah captures the epic panorama of World War II and illuminates an intimate part of history seldom seen: the women's war.",
    "Image": "https://covers.openlibrary.org/b/id/8314147-L.jpg"
  },
  {
    "Book_Name": "Expecting the Playboy's Heir",
    "Author": "Penny Jordan",
    "Year": 2005,
    "Quantity": 32,
    "Category": "romance",
    "Description": "Sally Spencer's had a secret crush on Eirik Sarantos for years, and now she's in real trouble. Because succumbing to Eirik's wild seduction has gotten Sally pregnant. And Eirik isn't just a heartless playboy, but the heir to a kingdom. The only way he can claim his heir is if he takes Sally as his bride!",
    "Image": "https://covers.openlibrary.org/b/id/1155071-L.jpg"
  },
  {
    "Book_Name": "The Song of Achilles",
    "Author": "Madeline Miller",
    "Year": 2011,
    "Quantity": 10,
    "Category": "romance",
    "Description": "Greece in the age of heroes. Patroclus, an awkward young prince, has been exiled to the court of King Peleus and his perfect son Achilles. By all rights, their paths should never cross, but Achilles takes the shamed prince as his friend, and as they grow into young men skilled in the arts of war and medicine, their bond blossoms into something deeper - despite the displeasure of Achilles' mother Thetis, a cruel sea goddess.",
    "Image": "https://covers.openlibrary.org/b/id/7098465-L.jpg"
  },
  {
    "Book_Name": "Silent Vows",
    "Author": "Jill Ramsower",
    "Year": 2022,
    "Quantity": 20,
    "Category": "romance",
    "Description": "Marriage seemed out of the realm of possibility for both Blake and Shayla until life threw them together on a stormy night. But, as quickly as they fell together, everything crumbled around them. Shayla is content with that night being the best she can hope for... until Blake shows up in her life again. When given the chance to reunite, will they be able to keep their vows silent or will their pasts destroy any chance they have at happiness?",
    "Image": "https://covers.openlibrary.org/b/id/13011571-L.jpg"
  },
  {
    "Book_Name": "Me Before You",
    "Author": "Jojo Moyes, Various",
    "Year": 2012,
    "Quantity": 38,
    "Category": "romance",
    "Description": "Louisa Clark is an ordinary girl living an exceedingly ordinary life—steady boyfriend, close family—who has never been farther afield than their tiny village. She takes a badly needed job working for ex-Master of the Universe Will Traynor, who is wheelchair-bound after an accident. Will is acerbic, moody, bossy—but Lou refuses to treat him with kid gloves, and soon his happiness means more to her than she expected.",
    "Image": "https://covers.openlibrary.org/b/id/14419339-L.jpg"
  },
  {
    "Book_Name": "Dead Until Dark (Sookie Stackhouse, #1)",
    "Author": "Charlaine Harris",
    "Year": 2001,
    "Quantity": 16,
    "Category": "romance",
    "Description": "Sookie Stackhouse is just a small-time cocktail waitress in small-town Louisiana. Until the vampire of her dreams walks into her life-and one of her coworkers checks out.... Maybe having a vampire for a boyfriend isn't such a bright idea.",
    "Image": "https://covers.openlibrary.org/b/id/6399102-L.jpg"
  },
  {
    "Book_Name": "The Rosie Project",
    "Author": "Graeme Simsion",
    "Year": 2013,
    "Quantity": 26,
    "Category": "romance",
    "Description": "Don Tillman, professor of genetics, has never been on a second date. He is a man who can count all his friends on the fingers of one hand, whose lifelong difficulty with social rituals has convinced him that he is simply not wired for romance. So when an acquaintance informs him that he would make a wonderful husband, his first reaction is shock. Yet he must concede to the statistical probability that there is someone for everyone, and he embarks upon The Wife Project.",
    "Image": "https://covers.openlibrary.org/b/id/10186221-L.jpg"
  },
  {
    "Book_Name": "Insurgent",
    "Author": "Veronica Roth, Gemme",
    "Year": 2011,
    "Quantity": 40,
    "Category": "romance",
    "Description": "One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love.",
    "Image": "https://covers.openlibrary.org/b/id/7083755-L.jpg"
  },
  {
    "Book_Name": "Painted Scars",
    "Author": "Neva Altaj",
    "Year": 2022,
    "Quantity": 21,
    "Category": "romance",
    "Description": "Once a celebrated child prodigy, Ivy is now a single mother, disowned by her family and estranged from her child. Years after escaping an abusive relationship, she re-enters society, hoping to heal the fractured bonds with her sister and son. However, she soon finds herself entangled with a man who reawakens feelings she thought long dead, while a ghost from her past threatens to shatter her fragile existence once more.",
    "Image": "https://covers.openlibrary.org/b/id/14630721-L.jpg"
  },
  {
    "Book_Name": "The Italian's Inexperienced Mistress",
    "Author": "Lynne Graham",
    "Year": 2007,
    "Quantity": 24,
    "Category": "romance",
    "Description": "Allegra Kallas detests Draco Papandreou-and she especially can't stand the desire she feels whenever she sees the arrogant man who once rejected her! So she's horrified when her father's business runs into debt and the only man who can save them is none other than the ruthless Greek... Draco has a score to settle with Allegra Kallas and he's going to settle it. By forcing her to be his mistress!",
    "Image": "https://covers.openlibrary.org/b/id/1185939-L.jpg"
  },
  {
    "Book_Name": "Time Traveler's Wife",
    "Author": "Audrey Niffenegger, William Hope, Laurel Lefkow",
    "Year": 2003,
    "Quantity": 31,
    "Category": "romance",
    "Description": "Clare, a beautiful art student, and Henry, an adventuresome librarian, have known each other since Clare was six and Henry was thirty-six, and were married when Clare was twenty-three and Henry thirty-one. Impossible but true, because Henry is one of the first people diagnosed with Chrono-Displacement Disorder: periodically his genetic clock resets and he finds himself misplaced in time, pulled to moments of emotional gravity in his life.",
    "Image": "https://covers.openlibrary.org/b/id/9273734-L.jpg"
  },
  {
    "Book_Name": "Water for Elephants",
    "Author": "Sara Gruen, David LeDoux, John Randolph Jones",
    "Year": 2006,
    "Quantity": 30,
    "Category": "romance",
    "Description": "Orphaned and penniless at the height of the Depression, Jacob Jankowski escapes everything he knows by jumping on a passing train—and inadvertently runs away with the circus. So begins Water for Elephants, Sara Gruen’s darkly beautiful tale about the characters who inhabit the less-than-greatest show on earth.",
    "Image": "https://covers.openlibrary.org/b/id/6690864-L.jpg"
  },
  {
    "Book_Name": "The Greek's Bought Wife",
    "Author": "Helen Bianchin",
    "Year": 2005,
    "Quantity": 12,
    "Category": "romance",
    "Description": "Single mother and schoolteacher Natalie has never been one to do things on impulse. So when she decides to take a chance on a mysterious stranger, she knows she is playing with fire. The intensity of her attraction to Greek millionaire Demitri Makricosta surprises her—it's overwhelming and unsettling.",
    "Image": "https://covers.openlibrary.org/b/id/215102-L.jpg"
  },
  {
    "Book_Name": "River's End",
    "Author": "Nora Roberts",
    "Year": 1999,
    "Quantity": 13,
    "Category": "romance",
    "Description": "Olivia's parents were among Hollywood's golden couples... until the night a monster came and took her mother away forever. A monster with the face of her father... Sheltered from the truth, an older Olivia only dimly recalls her night of terror—but her recurring nightmares make her realize she must piece together the real story. Now, assisted by Noah Brady, the son of the police detective who found her cowering in her closet so many years before, she may have her chance.",
    "Image": "https://covers.openlibrary.org/b/id/1370306-L.jpg"
  },
  {
    "Book_Name": "Sleeping Beauty",
    "Author": "Jude Deveraux",
    "Year": 1998,
    "Quantity": 22,
    "Category": "romance",
    "Description": "Once upon a time...as a fair maiden lay weeping upon a cold tombstone, her heartfelt desire was suddenly made real before her: tall, broad of shoulder, attired in gleaming silver and gold, her knight in shining armor had come to rescue his damsel in distress... A Knight in Shining Armor Hailed worldwide as one of the most romantic novels of all time, Jude Deveraux's dazzling bestseller \"will capture your heart—and hold it\" (Daily Herald, Chicago) with its breathtaking tale of lovely Dougless Montgomery; her savior knight, Nicholas Stafford, Earl of Thornwyck; and the timeless adventure of passion and memory, danger and desire that sweeps them into each other's arms.",
    "Image": "https://covers.openlibrary.org/b/id/569006-L.jpg"
  },
  {
    "Book_Name": "Twilight",
    "Author": "Stephenie Meyer",
    "Year": 2005,
    "Quantity": 28,
    "Category": "horror",
    "Description": "When Bella Swan moves to the gloomy town of Forks and meets the mysterious Edward Cullen, her life takes a thrilling and terrifying turn as she discovers his dark secret.",
    "Image": "https://covers.openlibrary.org/b/id/12641977-L.jpg"
  },
  {
    "Book_Name": "The Power of Darkness",
    "Author": "Edith Nesbit",
    "Year": 2006,
    "Quantity": 40,
    "Category": "horror",
    "Description": "A collection of chilling tales that explore the darker side of human nature and supernatural occurrences, penned by the renowned author Edith Nesbit.",
    "Image": "https://covers.openlibrary.org/b/id/882715-L.jpg"
  },
  {
    "Book_Name": "New Moon",
    "Author": "Stephenie Meyer",
    "Year": 2006,
    "Quantity": 29,
    "Category": "horror",
    "Description": "In this sequel to Twilight, Bella Swan faces new dangers and heartbreak as she delves deeper into the supernatural world of vampires and werewolves.",
    "Image": "https://covers.openlibrary.org/b/id/12643406-L.jpg"
  },
  {
    "Book_Name": "13 Horror Stories",
    "Year": 2010,
    "Quantity": 32,
    "Category": "horror",
    "Description": "A collection of thirteen spine-chilling horror stories that will keep readers on the edge of their seats, filled with suspense and supernatural elements.",
    "Image": "https://covers.openlibrary.org/b/id/13847176-L.jpg"
  },
  {
    "Book_Name": "Horror Stories",
    "Author": "Liz Phair",
    "Year": 2019,
    "Quantity": 15,
    "Category": "horror",
    "Description": "Liz Phair's collection of horror stories that delve into the darkest corners of the human psyche, exploring fear, suspense, and the supernatural.",
    "Image": "https://covers.openlibrary.org/b/id/9010010-L.jpg"
  },
  {
    "Book_Name": "Coraline",
    "Author": "Neil Gaiman",
    "Year": 2002,
    "Quantity": 18,
    "Category": "horror",
    "Description": "A dark fantasy novella about Coraline Jones, who discovers a parallel world where everything seems perfect—until she uncovers its sinister secrets.",
    "Image": "https://covers.openlibrary.org/b/id/14171421-L.jpg"
  },
  {
    "Book_Name": "Victorian Horror Stories",
    "Author": "Mike Stocks",
    "Year": 2002,
    "Quantity": 29,
    "Category": "horror",
    "Description": "Experience the eerie and supernatural tales from the Victorian era, showcasing the ghostly, mysterious, and macabre themes that defined the period.",
    "Image": "https://covers.openlibrary.org/b/id/4676008-L.jpg"
  },
  {
    "Book_Name": "Breaking Dawn",
    "Author": "Stephenie Meyer",
    "Year": 2008,
    "Quantity": 13,
    "Category": "horror",
    "Description": "The conclusion to Stephenie Meyer's Twilight Saga, where the supernatural world collides with mortal consequences as Bella Swan faces her ultimate destiny.",
    "Image": "https://covers.openlibrary.org/b/id/12643419-L.jpg"
  },
  {
    "Book_Name": "Horror story and other horror stories",
    "Author": "Robert Boyczuk",
    "Year": 2008,
    "Quantity": 11,
    "Category": "horror",
    "Description": "A collection of Robert Boyczuk's horror tales that plunge readers into a realm of fear, where the unknown and the unimaginable lurk in every shadow.",
    "Image": "https://covers.openlibrary.org/b/id/10013294-L.jpg"
  },
  {
    "Book_Name": "Horror Stories (Penguin Worlds)",
    "Author": "Edith Nesbit, Naomi Alderman",
    "Year": 2016,
    "Quantity": 20,
    "Category": "horror",
    "Description": "A unique collaboration featuring horror stories by Edith Nesbit and Naomi Alderman, blending classic and contemporary elements of fear and suspense.",
    "Image": "https://covers.openlibrary.org/b/id/8568267-L.jpg"
  },
  {
    "Book_Name": "Horror Stories",
    "Author": "Jaydeep Shah",
    "Year": 2015,
    "Quantity": 35,
    "Category": "horror",
    "Description": "Jaydeep Shah's collection of horror stories that delve into the depths of terror, weaving narratives that haunt the mind long after the last page.",
    "Image": "https://covers.openlibrary.org/b/id/10497198-L.jpg"
  },
  {
    "Book_Name": "My Favorite Horror Story",
    "Author": "Mike Baker, Martin H. Greenberg, Mike Baker, Robert Bloch, Nathaniel Hawthorne, Edgar Allan Poe, Ambrose Bierce",
    "Year": 2000,
    "Quantity": 32,
    "Category": "horror",
    "Description": "A curated anthology of classic horror stories by acclaimed authors such as Edgar Allan Poe and Nathaniel Hawthorne, showcasing the best in horror literature.",
    "Image": "https://covers.openlibrary.org/b/id/12315499-L.jpg"
  },
  {
    "Book_Name": "Kasey's Short Horror Stories",
    "Author": "Kasey Aaron Edwards Mr.",
    "Year": 2012,
    "Quantity": 18,
    "Category": "horror",
    "Description": "Kasey Aaron Edwards Mr.'s compilation of short horror stories that immerse readers in terrifying scenarios, each tale designed to leave a lasting shiver.",
    "Image": "https://covers.openlibrary.org/b/id/9063914-L.jpg"
  },
  {
    "Book_Name": "Library of classic horror stories",
    "Author": "Courage Books (Firm)",
    "Year": 2001,
    "Quantity": 34,
    "Category": "horror",
    "Description": "A comprehensive library featuring classic horror stories from renowned authors, capturing the essence of fear and suspense across different eras.",
    "Image": "https://covers.openlibrary.org/b/id/513387-L.jpg"
  },
  {
    "Book_Name": "Horror : HAUNTED DOLLS HORROR STORIES",
    "Author": "Robert Hickson",
    "Year": 2019,
    "Quantity": 38,
    "Category": "horror",
    "Description": "A compilation of horror stories featuring haunted dolls, penned by Robert Hickson, promising readers eerie tales of possessed and malevolent toys.",
    "Image": "https://covers.openlibrary.org/b/id/10234326-L.jpg"
  },
  {
    "Book_Name": "Dracula",
    "Author": "Bram Stoker",
    "Year": 2017,
    "Quantity": 34,
    "Category": "horror",
    "Description": "Bram Stoker's timeless tale of Count Dracula, the iconic vampire who terrorizes London, leading to a thrilling battle between good and evil.",
    "Image": "https://covers.openlibrary.org/b/id/13167087-L.jpg"
  },
  {
    "Book_Name": "The Hunger Games",
    "Author": "Suzanne Collins",
    "Year": 2008,
    "Quantity": 21,
    "Category": "Fiction",
    "Description": "In a dystopian future, Katniss Everdeen volunteers to take her sister's place in a televised fight to the death, navigating moral dilemmas, survival strategies, and a budding rebellion.",
    "Image": "https://covers.openlibrary.org/b/id/12646537-L.jpg"
  },
  {
    "Book_Name": "The Kite Runner",
    "Author": "Khaled Hosseini",
    "Year": 2003,
    "Quantity": 10,
    "Category": "Fiction",
    "Description": "Amir, haunted by guilt and redemption, tells the story of his childhood in Afghanistan and his complicated friendship with Hassan, amid a backdrop of tumultuous historical events.",
    "Image": "https://covers.openlibrary.org/b/id/9248224-L.jpg"
  },
  {
    "Book_Name": "Twilight",
    "Author": "Stephenie Meyer",
    "Year": 2005,
    "Quantity": 40,
    "Category": "Fiction",
    "Description": "When Bella Swan moves to the gloomy town of Forks and meets the mysterious Edward Cullen, her life takes a thrilling and terrifying turn as she discovers his dark secret.",
    "Image": "https://covers.openlibrary.org/b/id/12641977-L.jpg"
  },
  {
    "Book_Name": "Harry Potter and the Deathly Hallows",
    "Author": "J. K. Rowling",
    "Year": 2007,
    "Quantity": 14,
    "Category": "Fiction",
    "Description": "Harry Potter faces his final showdown with Voldemort, racing against time to destroy the remaining Horcruxes and save the wizarding world from darkness.",
    "Image": "https://covers.openlibrary.org/b/id/10110415-L.jpg"
  },
  {
    "Book_Name": "The Lost Symbol",
    "Author": "Dan Brown",
    "Year": 2009,
    "Quantity": 35,
    "Category": "Fiction",
    "Description": "Robert Langdon unravels a mysterious conspiracy involving the secrets of the Freemasons, navigating through Washington D.C.'s hidden history and enigmatic symbols.",
    "Image": "https://covers.openlibrary.org/b/id/8373389-L.jpg"
  },
  {
    "Book_Name": "Harry Potter and the Order of the Phoenix",
    "Author": "J. K. Rowling",
    "Year": 2003,
    "Quantity": 12,
    "Category": "Fiction",
    "Description": "Harry Potter returns to Hogwarts amidst rising tensions and internal strife, preparing for the ultimate battle against Voldemort while facing personal and political challenges.",
    "Image": "https://covers.openlibrary.org/b/id/10523466-L.jpg"
  },
  {
    "Book_Name": "The Da Vinci Code",
    "Author": "Dan Brown",
    "Year": 2003,
    "Quantity": 34,
    "Category": "Fiction",
    "Description": "Robert Langdon races across Europe to unravel the mystery of the Holy Grail, pursued by relentless adversaries and uncovering secrets that could shake the foundations of Christianity.",
    "Image": "https://covers.openlibrary.org/b/id/9255229-L.jpg"
  },
  {
    "Book_Name": "Harry Potter and the Half-Blood Prince",
    "Author": "J. K. Rowling",
    "Year": 2005,
    "Quantity": 13,
    "Category": "Fiction",
    "Description": "As Voldemort tightens his grip on both Muggle and wizarding worlds, Harry Potter delves into Dumbledore's past, seeking crucial information and preparing for the final battle.",
    "Image": "https://covers.openlibrary.org/b/id/10716273-L.jpg"
  },
  {
    "Book_Name": "Angels & Demons",
    "Author": "Dan Brown",
    "Year": 2000,
    "Quantity": 31,
    "Category": "Fiction",
    "Description": "Robert Langdon investigates the murder of a physicist and uncovers a centuries-old conspiracy of the Illuminati, racing against time to prevent a catastrophic event at the Vatican.",
    "Image": "https://covers.openlibrary.org/b/id/11408459-L.jpg"
  },
  {
    "Book_Name": "Harry Potter and the Prisoner of Azkaban",
    "Author": "J. K. Rowling",
    "Year": 1999,
    "Quantity": 39,
    "Category": "Fiction",
    "Description": "Harry Potter returns to Hogwarts for his third year, confronting the escape of Sirius Black and uncovering dark truths about his family and the wizarding world.",
    "Image": "https://covers.openlibrary.org/b/id/10580435-L.jpg"
  },
  {
    "Book_Name": "Fifty Shades of Grey",
    "Author": "E. L. James",
    "Year": 2000,
    "Quantity": 23,
    "Category": "Fiction",
    "Description": "Anastasia Steele enters a passionate and complicated relationship with Christian Grey, exploring themes of desire, control, and the limits of physical and emotional intimacy.",
    "Image": "https://covers.openlibrary.org/b/id/12648183-L.jpg"
  },
  {
    "Book_Name": "The Gruffalo",
    "Author": "Julia Donaldson",
    "Year": 1999,
    "Quantity": 25,
    "Category": "Fiction",
    "Description": "A clever mouse outwits predators by inventing a terrifying creature called the Gruffalo, only to face a real one in this charming and witty children's tale.",
    "Image": "https://covers.openlibrary.org/b/id/8561698-L.jpg"
  },
  {
    "Book_Name": "La sombra del viento",
    "Author": "Carlos Ruiz Zafón",
    "Year": 2001,
    "Quantity": 15,
    "Category": "Fiction",
    "Description": "In post-war Barcelona, Daniel Sempere is led into a labyrinthine mystery surrounding a forgotten author and his haunted book, discovering secrets that threaten his life.",
    "Image": "https://covers.openlibrary.org/b/id/10107644-L.jpg"
  },
  {
    "Book_Name": "Deception Point",
    "Author": "Dan Brown",
    "Year": 2001,
    "Quantity": 34,
    "Category": "Fiction",
    "Description": "Rachel Sexton, a scientist, and Michael Tolland, an oceanographer, uncover a shocking conspiracy involving NASA, battling deception and danger in a race against time.",
    "Image": "https://covers.openlibrary.org/b/id/14553479-L.jpg"
  },
  {
    "Book_Name": "The Boy in the Striped Pyjamas",
    "Author": "John Boyne",
    "Year": 2006,
    "Quantity": 21,
    "Category": "Fiction",
    "Description": "During World War II, eight-year-old Bruno befriends a boy named Shmuel, unaware of the devastating reality of the concentration camp that separates them by a fence.",
    "Image": "https://covers.openlibrary.org/b/id/12720687-L.jpg"
  },
  {
    "Book_Name": "The Blind Assassin",
    "Author": "Margaret Atwood",
    "Year": 2000,
    "Quantity": 10,
    "Category": "Fiction",
    "Description": "A complex tale of sisters, secrets, and lost love unfolds as Iris Chase reflects on her life, including her sister's posthumously published novel, 'The Blind Assassin.'",
    "Image": "https://covers.openlibrary.org/b/id/11041760-L.jpg"
  },
  {
    "Book_Name": "New Moon",
    "Author": "Stephenie Meyer",
    "Year": 2006,
    "Quantity": 11,
    "Category": "Fiction",
    "Description": "In this sequel to Twilight, Bella Swan faces new dangers and heartbreak as she delves deeper into the supernatural world of vampires and werewolves.",
    "Image": "https://covers.openlibrary.org/b/id/12643406-L.jpg"
  },
  {
    "Book_Name": "Artemis Fowl",
    "Author": "Eoin Colfer",
    "Year": 1999,
    "Quantity": 38,
    "Category": "Fiction",
    "Description": "Artemis Fowl, a young criminal mastermind, kidnaps a fairy and holds her for ransom, setting off a series of events that pit him against the magical world's forces.",
    "Image": "https://covers.openlibrary.org/b/id/10212689-L.jpg"
  },
  {
    "Book_Name": "Fifty Shades Darker",
    "Author": "E. L. James",
    "Year": 2011,
    "Quantity": 31,
    "Category": "Fiction",
    "Description": "Anastasia Steele navigates her intense relationship with Christian Grey, facing external threats and uncovering Grey's troubled past while reevaluating their bond.",
    "Image": "https://covers.openlibrary.org/b/id/14566702-L.jpg"
  },
  {
    "Book_Name": "Catching Fire",
    "Author": "Suzanne Collins",
    "Year": 2009,
    "Quantity": 10,
    "Category": "Fiction",
    "Description": "Katniss Everdeen faces new challenges as the Capitol retaliates against her victory in the Hunger Games, sparking a rebellion that threatens the fragile balance of Panem.",
    "Image": "https://covers.openlibrary.org/b/id/12646539-L.jpg"
  },
  {
    "Book_Name": "Coraline",
    "Author": "Neil Gaiman",
    "Year": 2002,
    "Quantity": 17,
    "Category": "Fiction",
    "Description": "Coraline discovers a parallel world where everything seems perfect, until she encounters sinister doppelgängers of her parents and must fight to save herself and her real family.",
    "Image": "https://covers.openlibrary.org/b/id/14171421-L.jpg"
  },
  {
    "Book_Name": "Inferno",
    "Author": "Dan Brown",
    "Year": 2013,
    "Quantity": 10,
    "Category": "Fiction",
    "Description": "Robert Langdon races against time across Florence and Istanbul to stop a deadly plague, deciphering Dante's Inferno and confronting moral dilemmas with global consequences.",
    "Image": "https://covers.openlibrary.org/b/id/9322673-L.jpg"
  },
  {
    "Book_Name": "Breaking Dawn",
    "Author": "Stephenie Meyer",
    "Year": 2008,
    "Quantity": 33,
    "Category": "Fiction",
    "Description": "In the conclusion to the Twilight Saga, Bella Swan navigates the complexities of her new life as a vampire, facing escalating conflicts and life-changing decisions.",
    "Image": "https://covers.openlibrary.org/b/id/12643419-L.jpg"
  },
  {
    "Book_Name": "Fifty Shades Freed",
    "Author": "E. L. James",
    "Year": 2011,
    "Quantity": 38,
    "Category": "Fiction",
    "Description": "Anastasia Steele and Christian Grey face the challenges of married life, confronting past adversaries and embracing new beginnings amidst unresolved threats.",
    "Image": "https://covers.openlibrary.org/b/id/14566669-L.jpg"
  },
  {
    "Book_Name": "The Lightning Thief",
    "Author": "Rick Riordan",
    "Year": 2005,
    "Quantity": 25,
    "Category": "Fiction",
    "Description": "Percy Jackson discovers he is a demigod and embarks on a quest to prevent a war among the gods, facing mythical creatures and uncovering secrets about his own identity.",
    "Image": "https://covers.openlibrary.org/b/id/7239831-L.jpg"
  },
  {
    "Book_Name": "Life of Pi",
    "Author": "Yann Martel",
    "Year": 2001,
    "Quantity": 20,
    "Category": "Fiction",
    "Description": "Pi Patel survives a shipwreck in the Pacific Ocean, stranded on a lifeboat with a Bengal tiger named Richard Parker, forging an epic tale of survival and spirituality.",
    "Image": "https://covers.openlibrary.org/b/id/12840573-L.jpg"
  },
  {
    "Book_Name": "Mockingjay",
    "Author": "Suzanne Collins",
    "Year": 2010,
    "Quantity": 38,
    "Category": "Fiction",
    "Description": "Katniss Everdeen becomes the symbol of a revolution against the oppressive Capitol, navigating moral dilemmas and personal losses in the climactic conclusion of the Hunger Games trilogy.",
    "Image": "https://covers.openlibrary.org/b/id/12646459-L.jpg"
  },
  {
    "Book_Name": "The Bad Beginning",
    "Author": "Lemony Snicket",
    "Year": 1999,
    "Quantity": 21,
    "Category": "Fiction",
    "Description": "Orphans Violet, Klaus, and Sunny Baudelaire face misfortune and the sinister Count Olaf, embarking on a series of unfortunate events filled with dark humor and unexpected twists.",
    "Image": "https://covers.openlibrary.org/b/id/7255974-L.jpg"
  },
  {
    "Book_Name": "The Fault in Our Stars",
    "Author": "John Green",
    "Year": 2010,
    "Quantity": 27,
    "Category": "Fiction",
    "Description": "Hazel Grace Lancaster and Augustus Waters, two cancer-stricken teens, embark on a poignant journey of love and loss, exploring life's uncertainties and the pursuit of meaning.",
    "Image": "https://covers.openlibrary.org/b/id/7418786-L.jpg"
  },
  {
    "Book_Name": "Eclipse",
    "Author": "Stephenie Meyer",
    "Year": 2006,
    "Quantity": 37,
    "Category": "Fiction",
    "Description": "As Bella Swan faces graduation and impending transformation into a vampire, she must confront a dangerous vampire army and make critical choices between love and loyalty.",
    "Image": "https://covers.openlibrary.org/b/id/12643410-L.jpg"
  },
  {
    "Book_Name": "On Writing",
    "Author": "Stephen King",
    "Year": 1999,
    "Quantity": 12,
    "Category": "memoirs",
    "Description": "Stephen King reflects on his life and craft, blending memoir with practical advice for aspiring writers, offering insights into his creative process and personal journey.",
    "Image": "https://covers.openlibrary.org/b/id/9255939-L.jpg"
  },
  {
    "Book_Name": "Rib",
    "Author": "Matty B. Duran",
    "Year": 2017,
    "Quantity": 14,
    "Category": "memoirs",
    "Description": "Matty B. Duran shares his raw and inspiring story of resilience, survival, and redemption, reflecting on his experiences growing up in challenging circumstances and finding his path.",
    "Image": "https://covers.openlibrary.org/b/id/13711454-L.jpg"
  },
  {
    "Book_Name": "The Glass Castle",
    "Author": "Jeannette Walls",
    "Year": 2005,
    "Quantity": 25,
    "Category": "memoirs",
    "Description": "Jeannette Walls recounts her unconventional upbringing with dysfunctional but charismatic parents, exploring themes of poverty, family bonds, and resilience in the face of adversity.",
    "Image": "https://covers.openlibrary.org/b/id/11517692-L.jpg"
  },
  {
    "Book_Name": "Educated",
    "Author": "Tara Westover",
    "Year": 2018,
    "Quantity": 21,
    "Category": "memoirs",
    "Description": "Tara Westover recounts her remarkable journey from a survivalist family in Idaho to earning a PhD from Cambridge University, grappling with family loyalty, education, and self-discovery.",
    "Image": "https://covers.openlibrary.org/b/id/8314077-L.jpg"
  },
  {
    "Book_Name": "12 Years a Slave",
    "Author": "Solomon Northup",
    "Year": 2008,
    "Quantity": 36,
    "Category": "memoirs",
    "Description": "Solomon Northup's harrowing account of being kidnapped and sold into slavery in the pre-Civil War United States, detailing his fight for freedom and the brutality of slavery.",
    "Image": "https://covers.openlibrary.org/b/id/9009395-L.jpg"
  },
  {
    "Book_Name": "A Long Way Gone",
    "Author": "Ishmael Beah",
    "Year": 2007,
    "Quantity": 10,
    "Category": "memoirs",
    "Description": "Ishmael Beah tells his story of being a child soldier in Sierra Leone's civil war, recounting his survival and journey to reclaim his humanity amidst the horrors of war.",
    "Image": "https://covers.openlibrary.org/b/id/11592698-L.jpg"
  },
  {
    "Book_Name": "Personal Memoirs",
    "Author": "Ulysses S. Grant",
    "Year": 2000,
    "Quantity": 33,
    "Category": "memoirs",
    "Description": "Ulysses S. Grant reflects on his life as a soldier and statesman, offering insights into his military campaigns, presidency, and personal reflections on the Civil War era.",
    "Image": "https://covers.openlibrary.org/b/id/6448578-L.jpg"
  },
  {
    "Book_Name": "Personal Memoirs of Ulysses S. Grant",
    "Author": "Ulysses S. Grant",
    "Year": 2009,
    "Quantity": 36,
    "Category": "memoirs",
    "Description": "Ulysses S. Grant revisits his life and legacy, offering deep insights into his military career, presidency, and personal reflections on the challenges and triumphs of his era.",
    "Image": "https://covers.openlibrary.org/b/id/12621663-L.jpg"
  },
  {
    "Book_Name": "Shoe Dog",
    "Author": "Phil Knight, Philip H. Knight",
    "Year": 2016,
    "Quantity": 37,
    "Category": "memoirs",
    "Description": "Phil Knight shares his entrepreneurial journey founding Nike, reflecting on the challenges, triumphs, and personal growth that shaped one of the world's most iconic brands.",
    "Image": "https://covers.openlibrary.org/b/id/8858487-L.jpg"
  },
  {
    "Book_Name": "Elvis A Personal Memoir",
    "Author": "Chris Hutchins",
    "Year": 2015,
    "Quantity": 36,
    "Category": "memoirs",
    "Description": "Chris Hutchins offers a personal memoir of Elvis Presley, celebrating the life and legacy of the iconic performer, exploring his impact on music, culture, and fans worldwide.",
    "Image": "https://covers.openlibrary.org/b/id/11001166-L.jpg"
  },
  {
    "Book_Name": "Ian Fleming",
    "Author": "Robert Harling",
    "Year": 2015,
    "Quantity": 23,
    "Category": "memoirs",
    "Description": "Robert Harling shares insights into the life and works of Ian Fleming, offering a personal memoir that delves into the creation of James Bond and Fleming's impact on popular culture.",
    "Image": "https://covers.openlibrary.org/b/id/14310995-L.jpg"
  },
  {
    "Book_Name": "Personal Memoirs; Volume 2",
    "Author": "Ulysses S. Grant",
    "Year": 2018,
    "Quantity": 10,
    "Category": "memoirs",
    "Description": "Ulysses S. Grant continues his personal reflections in volume 2 of his memoirs, offering additional insights into his military campaigns, presidency, and personal challenges.",
    "Image": "https://covers.openlibrary.org/b/id/10924147-L.jpg"
  },
  {
    "Book_Name": "Finding Me",
    "Author": "Viola Davis",
    "Year": 2022,
    "Quantity": 32,
    "Category": "memoirs",
    "Description": "Viola Davis shares her journey from childhood poverty to becoming an award-winning actress, reflecting on identity, resilience, and the pursuit of authenticity in Hollywood.",
    "Image": "https://covers.openlibrary.org/b/id/12881450-L.jpg"
  },
  {
    "Book_Name": "Personal Memoirs of U.s. Grant",
    "Author": "Ulysses S. Grant, Peter Johnson",
    "Year": 2009,
    "Quantity": 37,
    "Category": "memoirs",
    "Description": "Ulysses S. Grant and Peter Johnson collaborate on a personal memoir, offering dual perspectives on Grant's life, military career, and presidency during a pivotal era in American history.",
    "Image": "https://covers.openlibrary.org/b/id/11564145-L.jpg"
  },
  {
    "Book_Name": "Brodsky",
    "Author": "Joseph Brodsky",
    "Year": 2004,
    "Quantity": 20,
    "Category": "memoirs",
    "Description": "Joseph Brodsky reflects on his life as a poet, exile, and Nobel laureate, offering poignant insights into creativity, politics, and the human condition through the lens of his personal experiences.",
    "Image": "https://covers.openlibrary.org/b/id/927293-L.jpg"
  },
  {
    "Book_Name": "In the Dream House",
    "Author": "Carmen Maria Machado",
    "Year": 2019,
    "Quantity": 25,
    "Category": "memoirs",
    "Description": "Carmen Maria Machado chronicles her experience in an abusive same-sex relationship, blending memoir with literary analysis, exploring themes of queerness, trauma, and survival.",
    "Image": "https://covers.openlibrary.org/b/id/11198151-L.jpg"
  },
  {
    "Book_Name": "The Personal Memoirs of Ulysses S. Grant",
    "Author": "Ulysses S. Grant",
    "Year": 2011,
    "Quantity": 18,
    "Category": "memoirs",
    "Description": "Ulysses S. Grant shares his personal memoirs, providing a candid and introspective account of his life, military career, and presidency, offering insights into his legacy.",
    "Image": "https://covers.openlibrary.org/b/id/8802421-L.jpg"
  },
  {
    "Book_Name": "When Breath Becomes Air",
    "Author": "Paul Kalanithi",
    "Year": 2016,
    "Quantity": 30,
    "Category": "memoirs",
    "Description": "Paul Kalanithi reflects on life and mortality after being diagnosed with terminal cancer, exploring the intersection of medicine, philosophy, and the meaning of life in the face of death.",
    "Image": "https://covers.openlibrary.org/b/id/11463139-L.jpg"
  },
  {
    "Book_Name": "Study Guide",
    "Author": "SuperSummary",
    "Year": 2017,
    "Quantity": 11,
    "Category": "Autobiography",
    "Description": "This study guide by SuperSummary provides a comprehensive analysis of a specific autobiography, offering detailed summaries, character analysis, themes, and discussion of significant quotes.",
    "Image": "https://covers.openlibrary.org/b/id/12366237-L.jpg"
  },
  {
    "Book_Name": "Study Guide",
    "Author": "Supersummary",
    "Year": 2019,
    "Quantity": 18,
    "Category": "Autobiography",
    "Description": "Supersummary's study guide dives deep into the themes, characters, and narrative style of a notable autobiography, providing insights and analysis to aid understanding.",
    "Image": "https://covers.openlibrary.org/b/id/13175019-L.jpg"
  },
  {
    "Book_Name": "The Audacity of Hope",
    "Author": "Barack Obama, Erwin Dorado, Claudia Casanova, Esther Roig Giménez",
    "Year": 2006,
    "Quantity": 28,
    "Category": "Autobiography",
    "Description": "Barack Obama shares his vision for America's future, blending personal anecdotes with political insights, advocating for unity, hope, and progress in the face of challenges.",
    "Image": "https://covers.openlibrary.org/b/id/468766-L.jpg"
  },
  {
    "Book_Name": "Steve Jobs",
    "Author": "Walter Isaacson",
    "Year": 2011,
    "Quantity": 40,
    "Category": "Autobiography",
    "Description": "Walter Isaacson presents a revealing portrait of Steve Jobs, exploring his visionary leadership, creativity, and relentless pursuit of perfection in revolutionizing technology and business.",
    "Image": "https://covers.openlibrary.org/b/id/12374726-L.jpg"
  },
  {
    "Book_Name": "Lemony Snicket",
    "Author": "Lemony Snicket",
    "Year": 2002,
    "Quantity": 39,
    "Category": "Autobiography",
    "Description": "Lemony Snicket narrates an eccentric and mysterious autobiography, weaving tales of literary adventures and the curious events that shaped his unconventional life and career.",
    "Image": "https://covers.openlibrary.org/b/id/6904009-L.jpg"
  },
  {
    "Book_Name": "Wings of Fire",
    "Author": "A. P. J. Abdul Kalam",
    "Year": 1999,
    "Quantity": 39,
    "Category": "Autobiography",
    "Description": "A. P. J. Abdul Kalam reflects on his journey from a small town in India to becoming a renowned scientist and the President, sharing insights on leadership, innovation, and nation-building.",
    "Image": "https://covers.openlibrary.org/b/id/9153819-L.jpg"
  },
  {
    "Book_Name": "The Innocent Man",
    "Author": "John Grisham",
    "Year": 2006,
    "Quantity": 30,
    "Category": "Autobiography",
    "Description": "John Grisham tells the gripping true story of Ron Williamson, a wrongly accused man facing death row, highlighting flaws in the justice system and the quest for justice and redemption.",
    "Image": "https://covers.openlibrary.org/b/id/9322895-L.jpg"
  },
  {
    "Book_Name": "How to Build a Car",
    "Author": "Adrian Newey",
    "Year": 2017,
    "Quantity": 17,
    "Category": "Autobiography",
    "Description": "Adrian Newey chronicles his career as a legendary Formula One designer, detailing the creation of iconic racing cars and the innovative engineering behind their success.",
    "Image": "https://covers.openlibrary.org/b/id/13168271-L.jpg"
  },
  {
    "Book_Name": "When Breath Becomes Air",
    "Author": "Paul Kalanithi",
    "Year": 2016,
    "Quantity": 18,
    "Category": "Autobiography",
    "Description": "Paul Kalanithi reflects on life and mortality after being diagnosed with terminal cancer, exploring the intersection of medicine, philosophy, and the meaning of life in the face of death.",
    "Image": "https://covers.openlibrary.org/b/id/11463139-L.jpg"
  },
  {
    "Book_Name": "Gender Queer",
    "Author": "Maia Kobabe",
    "Year": 2019,
    "Quantity": 16,
    "Category": "Autobiography",
    "Description": "Maia Kobabe shares a candid and introspective autobiography, navigating gender identity, relationships, and self-discovery with honesty, humor, and resilience.",
    "Image": "https://covers.openlibrary.org/b/id/12917625-L.jpg"
  },
  {
    "Book_Name": "Just Kids",
    "Author": "Patti Smith",
    "Year": 2006,
    "Quantity": 36,
    "Category": "Autobiography",
    "Description": "Patti Smith recalls her transformative friendship with photographer Robert Mapplethorpe in 1960s New York, intertwining their artistic journey, love, and the bohemian spirit of the era.",
    "Image": "https://covers.openlibrary.org/b/id/6671097-L.jpg"
  },
  {
    "Book_Name": "Einstein",
    "Author": "Walter Isaacson, Illus. with photos",
    "Year": 2007,
    "Quantity": 13,
    "Category": "Autobiography",
    "Description": "Walter Isaacson presents a comprehensive biography of Albert Einstein, exploring his scientific achievements, personal life, and enduring legacy as one of history's greatest minds.",
    "Image": "https://covers.openlibrary.org/b/id/474440-L.jpg"
  },
  {
    "Book_Name": "Educated",
    "Author": "Tara Westover",
    "Year": 2018,
    "Quantity": 19,
    "Category": "Autobiography",
    "Description": "Tara Westover recounts her remarkable journey from a survivalist family in Idaho to earning a PhD from Cambridge University, grappling with family loyalty, education, and self-discovery.",
    "Image": "https://covers.openlibrary.org/b/id/8314077-L.jpg"
  },
  {
    "Book_Name": "Visage volé",
    "Author": "Latifa, Chekeba Hachemi, Mercè Ubach Dorca",
    "Year": 2001,
    "Quantity": 30,
    "Category": "Autobiography",
    "Description": "Latifa shares her harrowing tale of surviving an abusive marriage and reclaiming her identity, offering a powerful testament to resilience, courage, and the pursuit of freedom.",
    "Image": "https://covers.openlibrary.org/b/id/2152042-L.jpg"
  },
  {
    "Book_Name": "Hidden Figures",
    "Author": "Margot Lee Shetterly",
    "Year": 2016,
    "Quantity": 13,
    "Category": "Autobiography",
    "Description": "Margot Lee Shetterly celebrates the untold stories of African American female mathematicians at NASA, whose calculations were crucial to America's space achievements despite facing racial and gender discrimination.",
    "Image": "https://covers.openlibrary.org/b/id/13270730-L.jpg"
  },
  {
    "Book_Name": "The Immortal Life of Henrietta Lacks",
    "Author": "Rebecca Skloot",
    "Year": 2009,
    "Quantity": 37,
    "Category": "Autobiography",
    "Description": "Rebecca Skloot investigates the life of Henrietta Lacks, whose cells were used in scientific research without her knowledge, raising profound ethical questions about medical ethics and justice.",
    "Image": "https://covers.openlibrary.org/b/id/8364866-L.jpg"
  },
  {
    "Book_Name": "Born a Crime",
    "Author": "Trevor Noah",
    "Year": 2016,
    "Quantity": 13,
    "Category": "Autobiography",
    "Description": "Trevor Noah recounts his upbringing in apartheid South Africa, navigating identity, race, and resilience through humor and candid storytelling in this inspiring memoir.",
    "Image": "https://covers.openlibrary.org/b/id/8294078-L.jpg"
  },
  {
    "Book_Name": "Eat, Pray, Love",
    "Author": "Elizabeth Gilbert",
    "Year": 2004,
    "Quantity": 39,
    "Category": "Autobiography",
    "Description": "Elizabeth Gilbert embarks on a year-long journey across Italy, India, and Indonesia to discover herself, sharing insights on spirituality, love, and the pursuit of happiness.",
    "Image": "https://covers.openlibrary.org/b/id/111433-L.jpg"
  },
  {
    "Book_Name": "The Boy Who Harnessed the Wind",
    "Author": "William Kamkwamba, Bryan Mealer, Korey Jackson",
    "Year": 2009,
    "Quantity": 33,
    "Category": "Autobiography",
    "Description": "William Kamkwamba recounts his incredible journey of building a windmill from scrap materials in Malawi, showcasing the power of innovation, determination, and hope.",
    "Image": "https://covers.openlibrary.org/b/id/6447181-L.jpg"
  },
  {
    "Book_Name": "First They Killed My Father",
    "Author": "Loung Ung",
    "Year": 2000,
    "Quantity": 21,
    "Category": "Autobiography",
    "Description": "Loung Ung recalls her childhood under the brutal Khmer Rouge regime in Cambodia, depicting survival, loss, and resilience amid the horrors of war and political upheaval.",
    "Image": "https://covers.openlibrary.org/b/id/38440-L.jpg"
  },
  {
    "Book_Name": "Genome",
    "Author": "Matt Ridley",
    "Year": 1999,
    "Quantity": 15,
    "Category": "Autobiography",
    "Description": "Matt Ridley explores the human genome and its implications, revealing the genetic blueprint that shapes our identity, behavior, and the future of scientific discovery.",
    "Image": "https://covers.openlibrary.org/b/id/1315392-L.jpg"
  },
  {
    "Book_Name": "Through My Eyes",
    "Author": "Ruby Bridges",
    "Year": 1999,
    "Quantity": 38,
    "Category": "Autobiography",
    "Description": "Ruby Bridges recounts her experience as the first African American child to desegregate an all-white elementary school in New Orleans, reflecting on courage, education, and civil rights.",
    "Image": "https://covers.openlibrary.org/b/id/383082-L.jpg"
  },
  {
    "Book_Name": "Between the World and Me",
    "Author": "Ta-Nehisi Coates",
    "Year": 2015,
    "Quantity": 14,
    "Category": "Autobiography",
    "Description": "Ta-Nehisi Coates writes a powerful letter to his son, exploring race in America, systemic racism, and the struggle for black identity and justice in a deeply personal and poignant memoir.",
    "Image": "https://covers.openlibrary.org/b/id/11328078-L.jpg"
  },
  {
    "Book_Name": "A Dog's Life",
    "Author": "Ann M. Martin",
    "Year": 2005,
    "Quantity": 10,
    "Category": "Autobiography",
    "Description": "Ann M. Martin narrates a heartwarming autobiography from the perspective of a dog, exploring loyalty, companionship, and the joy of sharing life's adventures with a beloved pet.",
    "Image": "https://covers.openlibrary.org/b/id/279117-L.jpg"
  },
  {
    "Book_Name": "Shoe Dog",
    "Author": "Phil Knight, Philip H. Knight",
    "Year": 2016,
    "Quantity": 10,
    "Category": "Autobiography",
    "Description": "Phil Knight recounts the journey of founding Nike, from selling shoes out of his car to building a global brand, reflecting on entrepreneurship, determination, and the spirit of innovation.",
    "Image": "https://covers.openlibrary.org/b/id/8858487-L.jpg"
  },
  {
    "Book_Name": "American Prometheus",
    "Author": "Kai Bird, Martin J. Sherwin",
    "Year": 2005,
    "Quantity": 18,
    "Category": "Autobiography",
    "Description": "Kai Bird and Martin J. Sherwin delve into the life of J. Robert Oppenheimer, exploring his role in the development of the atomic bomb and his complex legacy as a scientist and public figure.",
    "Image": "https://covers.openlibrary.org/b/id/6460516-L.jpg"
  },
  {
    "Book_Name": "Leonardo da Vinci",
    "Author": "Walter Isaacson",
    "Year": 2017,
    "Quantity": 30,
    "Category": "Autobiography",
    "Description": "Walter Isaacson presents a comprehensive biography of Leonardo da Vinci, exploring his artistic genius, scientific curiosity, and the enduring impact of his innovations across disciplines.",
    "Image": "https://covers.openlibrary.org/b/id/8087691-L.jpg"
  },
  {
    "Book_Name": "Alexander Hamilton",
    "Author": "Ron Chernow",
    "Year": 2004,
    "Quantity": 35,
    "Category": "Autobiography",
    "Description": "Ron Chernow chronicles the life of Alexander Hamilton, from his rise as a Founding Father to his pivotal role in shaping America's financial system, offering a nuanced portrait of ambition and legacy.",
    "Image": "https://covers.openlibrary.org/b/id/8261375-L.jpg"
  },
  {
    "Book_Name": "How to Be an Antiracist",
    "Author": "Ibram X. Kendi, Cristina Lizarbe",
    "Year": 2019,
    "Quantity": 38,
    "Category": "Autobiography",
    "Description": "Ibram X. Kendi examines the concept of antiracism, sharing his personal journey of understanding and challenging racist ideas and policies, advocating for a more just and equitable society.",
    "Image": "https://covers.openlibrary.org/b/id/12355529-L.jpg"
  },
  {
    "Book_Name": "Harry Potter and the Half-Blood Prince",
    "Author": "J. K. Rowling",
    "Year": 2005,
    "Quantity": 11,
    "Category": "Fantasy",
    "Description": "In the sixth book of the series, Harry Potter returns to Hogwarts and learns more about Lord Voldemort's dark past, while preparing for a final confrontation. Secrets are revealed, relationships tested, and the wizarding world faces its darkest hour.",
    "Image": "https://covers.openlibrary.org/b/id/10716273-L.jpg"
  },
  {
    "Book_Name": "Harry Potter and the Prisoner of Azkaban",
    "Author": "J. K. Rowling",
    "Year": 1999,
    "Quantity": 40,
    "Category": "Fantasy",
    "Description": "Harry Potter's third year at Hogwarts is marked by the escape of Sirius Black, a prisoner who seems to have ties to Harry's past. As secrets unravel and danger looms, Harry learns the truth about his parents and the power of friendship.",
    "Image": "https://covers.openlibrary.org/b/id/10580435-L.jpg"
  },
  {
    "Book_Name": "Harry Potter and the Order of the Phoenix",
    "Author": "J. K. Rowling",
    "Year": 2003,
    "Quantity": 34,
    "Category": "Fantasy",
    "Description": "In the fifth installment, Harry Potter returns to Hogwarts amidst growing tension in the wizarding world. As Voldemort's influence spreads, Harry must confront his destiny and form alliances to prepare for the ultimate battle.",
    "Image": "https://covers.openlibrary.org/b/id/10523466-L.jpg"
  },
  {
    "Book_Name": "Harry Potter and the Deathly Hallows",
    "Author": "J. K. Rowling",
    "Year": 2007,
    "Quantity": 32,
    "Category": "Fantasy",
    "Description": "The final chapter in the Harry Potter series sees Harry, Ron, and Hermione on a mission to destroy Voldemort's Horcruxes. As they face perilous challenges, the fate of the wizarding world hangs in the balance in an epic conclusion.",
    "Image": "https://covers.openlibrary.org/b/id/10110415-L.jpg"
  },
  {
    "Book_Name": "Twilight",
    "Author": "Stephenie Meyer",
    "Year": 2005,
    "Quantity": 35,
    "Category": "Fantasy",
    "Description": "Bella Swan's life takes a thrilling turn when she falls in love with Edward Cullen, a mysterious and captivating vampire. As their romance blossoms, Bella discovers a world of danger, passion, and supernatural secrets.",
    "Image": "https://covers.openlibrary.org/b/id/12641977-L.jpg"
  },
  {
    "Book_Name": "The Hunger Games",
    "Author": "Suzanne Collins",
    "Year": 2008,
    "Quantity": 22,
    "Category": "Fantasy",
    "Description": "In a dystopian future, Katniss Everdeen volunteers to take her sister's place in the annual Hunger Games, a brutal televised competition. As she fights for survival, Katniss becomes a symbol of resistance against oppression.",
    "Image": "https://covers.openlibrary.org/b/id/12646537-L.jpg"
  },
  {
    "Book_Name": "New Moon",
    "Author": "Stephenie Meyer",
    "Year": 2006,
    "Quantity": 15,
    "Category": "Fantasy",
    "Description": "After Edward Cullen leaves, Bella Swan finds solace in her friendship with Jacob Black. As she navigates her heartbreak and discovers Jacob's supernatural secret, Bella's world is plunged into danger and uncertainty.",
    "Image": "https://covers.openlibrary.org/b/id/12643406-L.jpg"
  },
  {
    "Book_Name": "Artemis Fowl",
    "Author": "Eoin Colfer",
    "Year": 1999,
    "Quantity": 27,
    "Category": "Fantasy",
    "Description": "Artemis Fowl, a young criminal mastermind, plots to exploit the fairy world's technology for his own gain. But when he kidnaps a fairy, he enters a dangerous game of wits and encounters creatures beyond his imagination.",
    "Image": "https://covers.openlibrary.org/b/id/10212689-L.jpg"
  },
  {
    "Book_Name": "Catching Fire",
    "Author": "Suzanne Collins",
    "Year": 2009,
    "Quantity": 25,
    "Category": "Fantasy",
    "Description": "In the second installment of the Hunger Games series, Katniss Everdeen faces the aftermath of her defiance in the arena. As rebellion stirs, Katniss becomes a symbol of hope while navigating complex alliances and escalating threats.",
    "Image": "https://covers.openlibrary.org/b/id/12646539-L.jpg"
  },
  {
    "Book_Name": "Coraline",
    "Author": "Neil Gaiman",
    "Year": 2002,
    "Quantity": 16,
    "Category": "Fantasy",
    "Description": "Coraline discovers a secret doorway to another world that mirrors her own but seems perfect. However, when her 'other' parents reveal their sinister intentions, Coraline must summon her courage to save herself and others trapped in the alternate reality.",
    "Image": "https://covers.openlibrary.org/b/id/14171421-L.jpg"
  },
  {
    "Book_Name": "Breaking Dawn",
    "Author": "Stephenie Meyer",
    "Year": 2008,
    "Quantity": 16,
    "Category": "Fantasy",
    "Description": "In the final book of the Twilight Saga, Bella Swan embraces her new life as a vampire and faces unexpected challenges. As tensions rise between vampires and werewolves, Bella's choices impact her loved ones and the future of their world.",
    "Image": "https://covers.openlibrary.org/b/id/12643419-L.jpg"
  },
  {
    "Book_Name": "The Lightning Thief",
    "Author": "Rick Riordan",
    "Year": 2005,
    "Quantity": 25,
    "Category": "Fantasy",
    "Description": "Percy Jackson discovers he is a demigod, the son of Poseidon, and embarks on a quest to prevent a war among the gods. With the help of his friends, Percy faces mythical creatures and learns about his extraordinary heritage.",
    "Image": "https://covers.openlibrary.org/b/id/7239831-L.jpg"
  },
  {
    "Book_Name": "American Gods",
    "Author": "Neil Gaiman",
    "Year": 2001,
    "Quantity": 40,
    "Category": "Fantasy",
    "Description": "Shadow Moon, recently released from prison, becomes entangled in a conflict between ancient gods and new deities. As he journeys across America, Shadow discovers the hidden truths about gods, belief, and the power of myths in modern society.",
    "Image": "https://covers.openlibrary.org/b/id/8494659-L.jpg"
  },
  {
    "Book_Name": "The Martian",
    "Author": "Andy Weir",
    "Year": 2011,
    "Quantity": 33,
    "Category": "Fantasy",
    "Description": "Stranded on Mars after a mission gone wrong, astronaut Mark Watney must rely on his ingenuity and resilience to survive. As he battles against the odds, NASA and his crewmates work tirelessly to bring him home in an exhilarating tale of human determination.",
    "Image": "https://covers.openlibrary.org/b/id/11447888-L.jpg"
  },
  {
    "Book_Name": "Artemis Fowl. The Eternity Code",
    "Author": "Eoin Colfer, Giovanni Rigano, Paolo Lamanna, Andrew Donkin",
    "Year": 2003,
    "Quantity": 23,
    "Category": "Fantasy",
    "Description": "Artemis Fowl, teenage genius and criminal mastermind, faces new challenges when his latest invention falls into the wrong hands. As he navigates betrayals and dangerous adversaries, Artemis must protect his family and reclaim his tech from the criminal underworld.",
    "Image": "https://covers.openlibrary.org/b/id/12636263-L.jpg"
  },
  {
    "Book_Name": "Room on the Broom",
    "Author": "Julia Donaldson",
    "Year": 2001,
    "Quantity": 16,
    "Category": "Fantasy",
    "Description": "In a delightful tale of friendship and magic, a kind witch invites various animals to join her on her broomstick. Together, they face a dragon's threat and discover the power of working together in this charming children's story.",
    "Image": "https://covers.openlibrary.org/b/id/10839950-L.jpg"
  },
  {
    "Book_Name": "Tintenherz",
    "Author": "Cornelia Funke",
    "Year": 2003,
    "Quantity": 28,
    "Category": "Fantasy",
    "Description": "Meggie discovers her father can bring characters from books to life when a villainous character escapes into their world. As they confront dangers from storybooks, Meggie learns about her father's past and the true power of words.",
    "Image": "https://covers.openlibrary.org/b/id/3330314-L.jpg"
  },
  {
    "Book_Name": "The Sea of Monsters",
    "Author": "Rick Riordan",
    "Year": 2005,
    "Quantity": 17,
    "Category": "Fantasy",
    "Description": "Percy Jackson embarks on a perilous journey to the Sea of Monsters to rescue his friend Grover and retrieve the Golden Fleece. As he faces mythical creatures and navigates treacherous waters, Percy learns more about his destiny as a demigod.",
    "Image": "https://covers.openlibrary.org/b/id/108909-L.jpg"
  },
  {
    "Book_Name": "The Children of Húrin",
    "Author": "J.R.R. Tolkien",
    "Year": 2001,
    "Quantity": 22,
    "Category": "Fantasy",
    "Description": "Set in Middle-earth, this epic tale follows the tragic fate of Túrin Turambar and his family cursed by Morgoth. As Túrin battles dragons and faces betrayal, his choices shape the destiny of his people in a gripping saga of honor and despair.",
    "Image": "https://covers.openlibrary.org/b/id/8220298-L.jpg"
  },
  {
    "Book_Name": "Tale of Despereaux",
    "Author": "Kate DiCamillo",
    "Year": 2003,
    "Quantity": 38,
    "Category": "Fantasy",
    "Description": "Despereaux, a brave and compassionate mouse, embarks on a quest to rescue Princess Pea and save the kingdom from darkness. With the help of unlikely allies, Despereaux learns about courage, forgiveness, and the power of love in this enchanting tale.",
    "Image": "https://covers.openlibrary.org/b/id/541143-L.jpg"
  },
  {
    "Book_Name": "The Penelopiad",
    "Author": "Margaret Atwood",
    "Year": 2005,
    "Quantity": 40,
    "Category": "Fantasy",
    "Description": "Penelope, wife of Odysseus, recounts her life in Hades and challenges the myths surrounding her loyalty and resilience. Through Penelope's perspective, Atwood weaves a feminist reimagining of Homer's epic, exploring timeless themes of identity and storytelling.",
    "Image": "https://covers.openlibrary.org/b/id/4860886-L.jpg"
  },
  {
    "Book_Name": "Oryx and Crake",
    "Author": "Margaret Atwood",
    "Year": 2002,
    "Quantity": 11,
    "Category": "Fantasy",
    "Description": "In a dystopian future, Snowman reflects on his friendship with Crake and Oryx, and the events that led to the collapse of human civilization. As he navigates a world of genetic engineering and corporate greed, Snowman seeks redemption and meaning.",
    "Image": "https://covers.openlibrary.org/b/id/12507658-L.jpg"
  },
  {
    "Book_Name": "Wintersmith",
    "Author": "Terry Pratchett",
    "Year": 2006,
    "Quantity": 30,
    "Category": "Fantasy",
    "Description": "Young witch Tiffany Aching accidentally attracts the attention of the Wintersmith, a powerful elemental force. As winter threatens to last forever, Tiffany must embrace her magical abilities and confront the consequences of her actions.",
    "Image": "https://covers.openlibrary.org/b/id/4941553-L.jpg"
  },
  {
    "Book_Name": "The Name of the Wind",
    "Author": "Patrick Rothfuss",
    "Year": 2007,
    "Quantity": 23,
    "Category": "Fantasy",
    "Description": "Kvothe, an innkeeper with a mysterious past, recounts his rise as a legendary figure known for his music, magic, and daring exploits. As Kvothe unveils his story, he faces powerful enemies and uncovers secrets that challenge everything he knows.",
    "Image": "https://covers.openlibrary.org/b/id/11480483-L.jpg"
  },
  {
    "Book_Name": "The Titan's Curse",
    "Author": "Rick Riordan",
    "Year": 2007,
    "Quantity": 28,
    "Category": "Fantasy",
    "Description": "In the third book of the series, Percy Jackson embarks on a quest to rescue the goddess Artemis from the clutches of a sinister titan. Alongside his friends, Percy faces mythological monsters and uncovers a treacherous plot that threatens the gods.",
    "Image": "https://covers.openlibrary.org/b/id/2815296-L.jpg"
  },
  {
    "Book_Name": "The Battle of the Labyrinth",
    "Author": "Rick Riordan",
    "Year": 2005,
    "Quantity": 15,
    "Category": "Fantasy",
    "Description": "Percy Jackson navigates the treacherous labyrinth of Daedalus to prevent an ancient foe from wreaking havoc on Olympus. With new allies and old friends, Percy confronts deadly challenges and discovers startling truths about his own destiny.",
    "Image": "https://covers.openlibrary.org/b/id/6274739-L.jpg"
  },
  {
    "Book_Name": "Dreamcatcher",
    "Author": "Stephen King",
    "Year": 2001,
    "Quantity": 22,
    "Category": "Fantasy",
    "Description": "Four friends on a hunting trip encounter an otherworldly threat that infects their minds and tests their loyalty. As they confront their shared past and the alien invasion, they must uncover the truth behind a chilling military experiment.",
    "Image": "https://covers.openlibrary.org/b/id/8400669-L.jpg"
  },
  {
    "Book_Name": "The Ocean at the End of the Lane",
    "Author": "Neil Gaiman",
    "Year": 2013,
    "Quantity": 21,
    "Category": "Fantasy",
    "Description": "Returning to his childhood home, a man recalls a magical encounter with the Hempstock family and the supernatural events that shaped his life. As memories resurface, he confronts forgotten fears and discovers the power of childhood innocence.",
    "Image": "https://covers.openlibrary.org/b/id/7258156-L.jpg"
  },
  {
    "Book_Name": "The Kingdom of Fantasy",
    "Author": "Elisabetta Dami, David Nel·lo, Larry Keys, Titi Plumederat, Koldo Biguri",
    "Year": 2005,
    "Quantity": 25,
    "Category": "Fantasy",
    "Description": "Geronimo Stilton embarks on an epic journey to the Kingdom of Fantasy, where he encounters dragons, fairies, and mythical creatures. With courage and determination, Geronimo must navigate enchanted realms to fulfill his destiny and save the kingdom.",
    "Image": "https://covers.openlibrary.org/b/id/14416105-L.jpg"
  },
  {
    "Book_Name": "Everything's Eventual",
    "Author": "Stephen King, Stephen King Peter Straub",
    "Year": 2002,
    "Quantity": 34,
    "Category": "Fantasy",
    "Description": "In this collection of short stories, Stephen King explores dark and supernatural themes with chilling intensity. From mysterious gifts to malevolent forces, each tale offers a glimpse into the shadows where ordinary lives collide with extraordinary horrors.",
    "Image": "https://covers.openlibrary.org/b/id/8585782-L.jpg"
  }]
